; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-12)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 )
(:init
(ontable b1)
(on b2 b9)
(on b3 b4)
(on b4 b8)
(ontable b5)
(on b6 b10)
(ontable b7)
(ontable b8)
(on b9 b11)
(on b10 b2)
(ontable b11)
(ontable b12)
(clear b1)
(clear b3)
(clear b5)
(clear b6)
(clear b7)
(clear b12)
)
(:goal
(and
(on b1 b12)
(on b2 b6)
(on b3 b9)
(on b4 b5)
(on b5 b10)
(on b7 b2)
(on b8 b11)
(on b9 b7)
(on b10 b3)
(on b11 b1)
(on b12 b4))
)
)

; plan
1. (move-b-to-t b6 b10)
   deleted: (on b6 b10)
   added: (ontable b6) (clear b10)
   goals met: 0 of 11
2. (move-b-to-b b10 b2 b1)
   deleted: (clear b1) (on b10 b2)
   added: (on b10 b1) (clear b2)
   goals met: 0 of 11
3. (move-b-to-b b2 b9 b6)
   deleted: (clear b6) (on b2 b9)
   added: (on b2 b6) (clear b9)
   goals met: 1 of 11
4. (move-t-to-b b7 b2)
   deleted: (clear b2) (ontable b7)
   added: (on b7 b2)
   goals met: 2 of 11
5. (move-b-to-b b9 b11 b7)
   deleted: (clear b7) (on b9 b11)
   added: (on b9 b7) (clear b11)
   goals met: 3 of 11
6. (move-b-to-b b3 b4 b9)
   deleted: (clear b9) (on b3 b4)
   added: (on b3 b9) (clear b4)
   goals met: 4 of 11
7. (move-b-to-b b10 b1 b3)
   deleted: (clear b3) (on b10 b1)
   added: (on b10 b3) (clear b1)
   goals met: 5 of 11
8. (move-t-to-b b5 b10)
   deleted: (clear b10) (ontable b5)
   added: (on b5 b10)
   goals met: 6 of 11
9. (move-b-to-b b4 b8 b5)
   deleted: (clear b5) (on b4 b8)
   added: (on b4 b5) (clear b8)
   goals met: 7 of 11
10. (move-t-to-b b12 b4)
   deleted: (clear b4) (ontable b12)
   added: (on b12 b4)
   goals met: 8 of 11
11. (move-t-to-b b1 b12)
   deleted: (clear b12) (ontable b1)
   added: (on b1 b12)
   goals met: 9 of 11
12. (move-t-to-b b11 b1)
   deleted: (clear b1) (ontable b11)
   added: (on b11 b1)
   goals met: 10 of 11
13. (move-t-to-b b8 b11)
   deleted: (clear b11) (ontable b8)
   added: (on b8 b11)
   goals met: 11 of 11
